[
  {
    "id": "mpala",
    "title": "MPALA Lab",
    "meta": "Motion Planning, Active Learning, and Autonomy Lab · Spring 2025 - Present",
    "summary": "My research has spanned designing and simulating resilient consensus protocols (such as W-MSR), tuning Kalman filters for localization accuracy, and translating theoretical models of multi-agent coordination into experimental demonstrations. I enjoy the challenge of bridging rigorous mathematical analysis with hands-on implementation, refining flight dynamics, and debugging distributed systems to make autonomous swarms robust against uncertainty and adversarial interference.",
    "tags": ["research", "lab"],
    "logo": "assets/mpalaLogo.png",
    "videos": ["3vim08XoM7w" , "cc0ZHdGcpwY" ],
    "links": [
      {
        "label": "Lab Website",
        "url": "https://www.georgekontoudis.com/lab/"
      }
    ]
  },
  {
    "id": "surf-poster-2025",
    "title": "Surf Poster – Multi-Agent Visualization",
    "meta": "Research Poster for SURF · Fall 2025",
    "summary": "A visual research artifact communicating multi-agent coordination concepts through generative surf-style graphics.",
    "tags": ["research", "visualization"]
  },
  {
  "id": "mirror",
  "title": "MIRROR Lab",
  "meta": "Mines Interactive Robotics Research Lab · Fall 2024 - Spring 2025",
  "summary": "Contributed to research on multi-robot teleoperation and AI-driven robotic systems with a focus on communication, coordination, and decision-making. Integrated multiple laboratory robots using ROS to enable collaborative experiments and structured data collection. Enhanced multi-teleoperation interfaces with DIARC, improving usability, responsiveness, and experimental performance. Developed and tested an AI-powered robotic assistant leveraging machine learning to improve real-time adaptability and decision-making. Co-authored a research paper on robotics and multi-agent systems (publication pending), contributing to technical writing and academic dissemination.",
  "tags": ["research", "lab", "multi-robot", "teleoperation"],
  "logo": "assets/mirrorLabLogo.png",
  "links": [
    {
      "label": "Lab Website",
      "url": "https://mirrorlab.mines.edu"
    }
  ]
}
]
