[
    {
        "date": "Dec 2025",
        "text": "<strong>Two papers accepted</strong> for oral presentation at the International Conference on Autonomous Agents and Multiagent Systems (AAMAS). Congratulations Sanket and Meet."
    },
    {
        "date": "Dec 2025",
        "text": "<strong>Paper published</strong> in IEEE Transactions on Machine Learning in Communications and Networking."
    },
    {
        "date": "Dec 2025",
        "text": "Aaron Fanganello joined the MPALA Lab as a graduate researcher."
    },
    {
        "date": "Nov 2025",
        "text": "Audrey Smith joined the MPALA Lab."
    },
    {
        "date": "Oct 2025",
        "text": "<strong>Invited talk</strong> given at the University of Colorado Boulder on resilient multi-agent control."
    },
    {
        "date": "Sep 2025",
        "text": "Travis Porter joined the MPALA Lab."
    },
    {
        "date": "Aug 2025",
        "text": "Dave Fobar joined the MPALA Lab."
    },
    {
        "date": "Aug 2025",
        "text": "Matthew Smith joined the MPALA Lab."
    },
    {
        "date": "Jul 2025",
        "text": "<strong>Invited talk</strong> presented at the Workshop on Data-Driven and Risk-Aware Control for Safety-Critical Autonomous Systems (ACC)."
    },
    {
        "date": "Jun 2025",
        "text": "<strong>Invited lecture</strong> delivered to the NSF RET cohort at Colorado School of Mines."
    },
    {
        "date": "Jun 2025",
        "text": "Daniel Kim and Ethan Brown joined the MPALA Lab."
    },
    {
        "date": "Jun 2025",
        "text": "<strong>Started serving</strong> as Associate Editor for IEEE Robotics and Automation Letters (RAL)."
    },
    {
        "date": "May 2025",
        "text": "Meet Gandhi joined the MPALA Lab."
    },
    {
        "date": "Apr 2025",
        "text": "<strong>Paper accepted</strong> for oral presentation at the IEEE Engineering in Medicine and Biology Conference (EMBC). Congratulations Mykola."
    },
    {
        "date": "Mar 2025",
        "text": "<strong>Poster presented</strong> at the Colorado School of Mines Undergraduate Research Symposium."
    },
    {
        "date": "Feb 2025",
        "text": "New experimental swarm robotics testbed deployed using Crazyflie drones and OptiTrack motion capture."
    },
    {
        "date": "Jan 2025",
        "text": "<strong>Research project launched</strong> on resilient consensus under adversarial network conditions."
    },
    {
        "date": "Dec 2024",
        "text": "MPALA Lab hosted an internal workshop on distributed control and estimation."
    },
    {
        "date": "Nov 2024",
        "text": "<strong>Grant awarded</strong> supporting research in multi-agent autonomy and learning."
    },
    {
        "date": "Oct 2024",
        "text": "New multi-robot simulation infrastructure integrated with ROS 2."
    }
]
